Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAMV71Q21B_DFP/component/xdmac.h
/* -------- XDMAC_CDUS : (XDMAC Offset: 0x34) (R/W 32) Channel Destination Microblock Stride -------- */
#define XDMAC_CDUS_DUBS_Pos                   (0U)                                           /**< (XDMAC_CDUS) Channel x Destination Microblock Stride Position */
#define XDMAC_CDUS_DUBS_Msk                   (0xFFFFFFU << XDMAC_CDUS_DUBS_Pos)             /**< (XDMAC_CDUS) Channel x Destination Microblock Stride Mask */
#define XDMAC_CDUS_DUBS(value)                (XDMAC_CDUS_DUBS_Msk & ((value) << XDMAC_CDUS_DUBS_Pos))
#define XDMAC_CDUS_Msk                        (0x00FFFFFFUL)                                 /**< (XDMAC_CDUS) Register Mask  */

/** \brief XDMAC register offsets definitions */
#define XDMAC_GTYPE_OFFSET             (0x00)         /**< (XDMAC_GTYPE) Global Type Register Offset */
#define XDMAC_GCFG_OFFSET              (0x04)         /**< (XDMAC_GCFG) Global Configuration Register Offset */
#define XDMAC_GWAC_OFFSET              (0x08)         /**< (XDMAC_GWAC) Global Weighted Arbiter Configuration Register Offset */
#define XDMAC_GIE_OFFSET               (0x0C)         /**< (XDMAC_GIE) Global Interrupt Enable Register Offset */
#define XDMAC_GID_OFFSET               (0x10)         /**< (XDMAC_GID) Global Interrupt Disable Register Offset */
#define XDMAC_GIM_OFFSET               (0x14)         /**< (XDMAC_GIM) Global Interrupt Mask Register Offset */
#define XDMAC_GIS_OFFSET               (0x18)         /**< (XDMAC_GIS) Global Interrupt Status Register Offset */
#define XDMAC_GE_OFFSET                (0x1C)         /**< (XDMAC_GE) Global Channel Enable Register Offset */
#define XDMAC_GD_OFFSET                (0x20)         /**< (XDMAC_GD) Global Channel Disable Register Offset */
#define XDMAC_GS_OFFSET                (0x24)         /**< (XDMAC_GS) Global Channel Status Register Offset */
#define XDMAC_GRS_OFFSET               (0x28)         /**< (XDMAC_GRS) Global Channel Read Suspend Register Offset */
#define XDMAC_GWS_OFFSET               (0x2C)         /**< (XDMAC_GWS) Global Channel Write Suspend Register Offset */
#define XDMAC_GRWS_OFFSET              (0x30)         /**< (XDMAC_GRWS) Global Channel Read Write Suspend Register Offset */
#define XDMAC_GRWR_OFFSET              (0x34)         /**< (XDMAC_GRWR) Global Channel Read Write Resume Register Offset */
#define XDMAC_GSWR_OFFSET              (0x38)         /**< (XDMAC_GSWR) Global Channel Software Request Register Offset */
#define XDMAC_GSWS_OFFSET              (0x3C)         /**< (XDMAC_GSWS) Global Channel Software Request Status Register Offset */
#define XDMAC_GSWF_OFFSET              (0x40)         /**< (XDMAC_GSWF) Global Channel Software Flush Request Register Offset */
#define XDMAC_CHID_OFFSET              (0x50)         /**< (XDMAC_CHID) Channel Interrupt Enable Register Offset */
  #define XDMAC_CIE_OFFSET               (0x00)         /**< (XDMAC_CIE) Channel Interrupt Enable Register Offset */
  #define XDMAC_CID_OFFSET               (0x04)         /**< (XDMAC_CID) Channel Interrupt Disable Register Offset */
  #define XDMAC_CIM_OFFSET               (0x08)         /**< (XDMAC_CIM) Channel Interrupt Mask Register Offset */
  #define XDMAC_CIS_OFFSET               (0x0C)         /**< (XDMAC_CIS) Channel Interrupt Status Register Offset */
  #define XDMAC_CSA_OFFSET               (0x10)         /**< (XDMAC_CSA) Channel Source Address Register Offset */
  #define XDMAC_CDA_OFFSET               (0x14)         /**< (XDMAC_CDA) Channel Destination Address Register Offset */
  #define XDMAC_CNDA_OFFSET              (0x18)         /**< (XDMAC_CNDA) Channel Next Descriptor Address Register Offset */
  #define XDMAC_CNDC_OFFSET              (0x1C)         /**< (XDMAC_CNDC) Channel Next Descriptor Control Register Offset */
  #define XDMAC_CUBC_OFFSET              (0x20)         /**< (XDMAC_CUBC) Channel Microblock Control Register Offset */
  #define XDMAC_CBC_OFFSET               (0x24)         /**< (XDMAC_CBC) Channel Block Control Register Offset */
  #define XDMAC_CC_OFFSET                (0x28)         /**< (XDMAC_CC) Channel Configuration Register Offset */
  #define XDMAC_CDS_MSP_OFFSET           (0x2C)         /**< (XDMAC_CDS_MSP) Channel Data Stride Memory Set Pattern Offset */
  #define XDMAC_CSUS_OFFSET              (0x30)         /**< (XDMAC_CSUS) Channel Source Microblock Stride Offset */
  #define XDMAC_CDUS_OFFSET              (0x34)         /**< (XDMAC_CDUS) Channel Destination Microblock Stride Offset */

/** \brief XDMAC_CHID register API structure */
typedef struct
{
  __O   uint32_t                       XDMAC_CIE;       /**< Offset: 0x00 ( /W  32) Channel Interrupt Enable Register */
  __O   uint32_t                       XDMAC_CID;       /**< Offset: 0x04 ( /W  32) Channel Interrupt Disable Register */
  __I   uint32_t                       XDMAC_CIM;       /**< Offset: 0x08 (R/   32) Channel Interrupt Mask Register */
  __I   uint32_t                       XDMAC_CIS;       /**< Offset: 0x0c (R/   32) Channel Interrupt Status Register */
  __IO  uint32_t                       XDMAC_CSA;       /**< Offset: 0x10 (R/W  32) Channel Source Address Register */
  __IO  uint32_t                       XDMAC_CDA;       /**< Offset: 0x14 (R/W  32) Channel Destination Address Register */
  __IO  uint32_t                       XDMAC_CNDA;      /**< Offset: 0x18 (R/W  32) Channel Next Descriptor Address Register */
  __IO  uint32_t                       XDMAC_CNDC;      /**< Offset: 0x1c (R/W  32) Channel Next Descriptor Control Register */
  __IO  uint32_t                       XDMAC_CUBC;      /**< Offset: 0x20 (R/W  32) Channel Microblock Control Register */
  __IO  uint32_t                       XDMAC_CBC;       /**< Offset: 0x24 (R/W  32) Channel Block Control Register */
  __IO  uint32_t                       XDMAC_CC;        /**< Offset: 0x28 (R/W  32) Channel Configuration Register */
  __IO  uint32_t                       XDMAC_CDS_MSP;   /**< Offset: 0x2c (R/W  32) Channel Data Stride Memory Set Pattern */
  __IO  uint32_t                       XDMAC_CSUS;      /**< Offset: 0x30 (R/W  32) Channel Source Microblock Stride */
  __IO  uint32_t                       XDMAC_CDUS;      /**< Offset: 0x34 (R/W  32) Channel Destination Microblock Stride */
  __I   uint8_t                        Reserved1[0x08];
} xdmac_chid_registers_t;
